app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "一覧アクションと一覧画面を実装する。\r\nあとで詳細、編集、削除のリンクを加えるニダ"], ["updated_at", "2018-11-28 09:09:17.179722"], ["id", 1]]
---
    task = Task.find(params[:id])
    task.update!(task_params)

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "どどどど"], ["description", "どどどどどど"], ["created_at", "2018-11-28 11:33:00.824196"], ["updated_at", "2018-11-28 11:33:00.824196"]]
---
    task = Task.new(task_params)
    task.save